# 1. Conceitos BÃ¡sicos de Pandas

### 1.4 Series

In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data = minha_lista, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
print(d)
pd.Series(d)

{'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series(
    data = [1, 2, 3, 4],
    index = ['EUA', 'ALE', 'ITA', 'JAP']
)

ser2 = pd.Series(
    data = [1, 2, 5, 4],
    index = ['EUA', 'ALE', 'RUS', 'JAP']
)

print(ser1)
print(ser2)

EUA    1
ALE    2
ITA    3
JAP    4
dtype: int64
EUA    1
ALE    2
RUS    5
JAP    4
dtype: int64

In [8]:
ser1[['EUA', 'ITA']]

EUA    1
ITA    3
dtype: int64

In [9]:
ser1[0]

1

In [10]:
ser1 + ser2

ALE    4.0
EUA    2.0
ITA    NaN
JAP    8.0
RUS    NaN
dtype: float64

### 1.5 DataFrames

In [11]:
from numpy.random import randn

df = pd.DataFrame(randn(5,4),
index='a b c d e'.split(),
columns='w x y z'.split()
)

df

          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672
e  0.684972  1.136586 -0.453412 -0.572243

In [12]:
print(type(df['w']))

df['w']

<class 'pandas.core.series.Series'>

a    0.514765
b   -0.310662
c   -1.846925
d   -0.097987
e    0.684972
Name: w, dtype: float64

In [13]:
df['new'] = df['w'] + df['x']

df

          w         x         y         z       new
a  0.514765 -0.107790  0.857174 -0.399881  0.406975
b -0.310662 -1.836111  0.247842 -0.171026 -2.146773
c -1.846925 -0.667985  1.888176 -0.076733 -2.514910
d -0.097987  0.498284  0.326594 -0.758672  0.400297
e  0.684972  1.136586 -0.453412 -0.572243  1.821558

Gerar uma cÃ³pia de df deletando df['new']

In [14]:
df.drop('new', axis=1) # axis = 1 -> coluna

          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672
e  0.684972  1.136586 -0.453412 -0.572243

deletando do original:

In [15]:
print(df)

del df['new']

# OU

# df.drop('new', axis=1, inplace=True)

df

          w         x         y         z       new
a  0.514765 -0.107790  0.857174 -0.399881  0.406975
b -0.310662 -1.836111  0.247842 -0.171026 -2.146773
c -1.846925 -0.667985  1.888176 -0.076733 -2.514910
d -0.097987  0.498284  0.326594 -0.758672  0.400297
e  0.684972  1.136586 -0.453412 -0.572243  1.821558

          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672
e  0.684972  1.136586 -0.453412 -0.572243

Subset por index ou columns:

In [16]:
print(df.loc[['a', 'b']])

print(df.loc[['b','c'], ['x', 'z']])

          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
          x         z
b -1.836111 -0.171026
c -0.667985 -0.076733

Busca elemento numericamente:

In [17]:
print(df.iloc[0, 2]) # (a, y)

df.iloc[0] # linha a

0.8571737215158043

w    0.514765
x   -0.107790
y    0.857174
z   -0.399881
Name: a, dtype: float64

### 1.6 iloc e Filtros

In [18]:
print(df.iloc[:, :]) # seleciona tudo

print(df.iloc[:, 1]) # tudo da coluna x

print(df.iloc[2, :]) # tudo da linha c

print(df.iloc[:-1, :]) # tudo menos a Ãºltima linha (e)

print(df.iloc[1:3, 2:4]) #seleciona linhas c : d e colunas y : z

          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672
e  0.684972  1.136586 -0.453412 -0.572243
a   -0.107790
b   -1.836111
c   -0.667985
d    0.498284
e    1.136586
Name: x, dtype: float64
w   -1.846925
x   -0.667985
y    1.888176
z   -0.076733
Name: c, dtype: float64
          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672
          y         z
b  0.247842 -0.171026
c  1.888176 -0.076733

dfs booleanos

In [19]:
df > 0

       w      x      y      z
a   True  False   True  False
b  False  False   True  False
c  False  False   True  False
d  False   True   True  False
e   True   True  False  False

In [20]:
df[df > 0]

          w         x         y   z
a  0.514765       NaN  0.857174 NaN
b       NaN       NaN  0.247842 NaN
c       NaN       NaN  1.888176 NaN
d       NaN  0.498284  0.326594 NaN
e  0.684972  1.136586       NaN NaN

In [21]:
print(df['y'] > 0)

df[df['y'] > 0] # retorna as linhas que forem TRUE

a     True
b     True
c     True
d     True
e    False
Name: y, dtype: bool

          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672

Subset manipulando combinaÃ§Ãµes de Bools

In [22]:
print('y:')
print(df['y'] > 0)

print('w:')
print(df['w'] > 0)

y:
a     True
b     True
c     True
d     True
e    False
Name: y, dtype: bool
w:
a     True
b    False
c    False
d    False
e     True
Name: w, dtype: bool

In [23]:
print('y AND w > 0:')
print((df['y'] > 0) & (df['w'] > 0))

print('\ny OR w > 0:')
print((df['y'] > 0) | (df['w'] > 0))

y AND w > 0:
a     True
b    False
c    False
d    False
e    False
dtype: bool

y OR w > 0:
a    True
b    True
c    True
d    True
e    True
dtype: bool

In [24]:
print('y AND w > 0:')
print(df[(df['y'] > 0) & (df['w'] > 0)])

print('\ny OR w > 0:')
print(df[(df['y'] > 0) | (df['w'] > 0)])

y AND w > 0:
          w        x         y         z
a  0.514765 -0.10779  0.857174 -0.399881

y OR w > 0:
          w         x         y         z
a  0.514765 -0.107790  0.857174 -0.399881
b -0.310662 -1.836111  0.247842 -0.171026
c -1.846925 -0.667985  1.888176 -0.076733
d -0.097987  0.498284  0.326594 -0.758672
e  0.684972  1.136586 -0.453412 -0.572243

### 1.7 OperaÃ§Ãµes com Ã­ndices

In [25]:
print(df.index)
print(df.columns)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index(['w', 'x', 'y', 'z'], dtype='object')

In [26]:
df.reset_index(inplace=True)
df

  index         w         x         y         z
0     a  0.514765 -0.107790  0.857174 -0.399881
1     b -0.310662 -1.836111  0.247842 -0.171026
2     c -1.846925 -0.667985  1.888176 -0.076733
3     d -0.097987  0.498284  0.326594 -0.758672
4     e  0.684972  1.136586 -0.453412 -0.572243

In [27]:
df.set_index('index', inplace=True)
df

              w         x         y         z
index
a      0.514765 -0.107790  0.857174 -0.399881
b     -0.310662 -1.836111  0.247842 -0.171026
c     -1.846925 -0.667985  1.888176 -0.076733
d     -0.097987  0.498284  0.326594 -0.758672
e      0.684972  1.136586 -0.453412 -0.572243

In [28]:
df['new_index'] = 'BA SE PB PE MA'.split()
print(df)
print(df.index)

# quando jÃ¡ temos um index, set_index vai apagar o antigo e substituir pelo novo
# para preservar o index antigo, usar reset_index antes!
df.reset_index(inplace=True)
df.set_index('new_index', inplace=True)
print(df.index)
df

              w         x         y         z new_index
index
a      0.514765 -0.107790  0.857174 -0.399881        BA
b     -0.310662 -1.836111  0.247842 -0.171026        SE
c     -1.846925 -0.667985  1.888176 -0.076733        PB
d     -0.097987  0.498284  0.326594 -0.758672        PE
e      0.684972  1.136586 -0.453412 -0.572243        MA
Index(['a', 'b', 'c', 'd', 'e'], dtype='object', name='index')
Index(['BA', 'SE', 'PB', 'PE', 'MA'], dtype='object', name='new_index')

          index         w         x         y         z
new_index
BA            a  0.514765 -0.107790  0.857174 -0.399881
SE            b -0.310662 -1.836111  0.247842 -0.171026
PB            c -1.846925 -0.667985  1.888176 -0.076733
PE            d -0.097987  0.498284  0.326594 -0.758672
MA            e  0.684972  1.136586 -0.453412 -0.572243

### 1.8 Ãndices multinÃ­vel

In [29]:
# NÃ­veios de indices
inside = [1,2,3, 1,2,3]
outside = 'G1 G1 G1 G2 G2 G2'.split()

hier_index = list(zip(outside, inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [30]:
# OU
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

df = pd.DataFrame(randn(6, 2), index=hier_index, columns=['a', 'b'])
df

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

             a         b
G1 1  1.147188  0.231934
   2 -1.521882 -0.025399
   3 -0.135156  0.548987
G2 1 -1.580583 -0.389317
   2  1.208457  0.643078
   3  1.577016  0.181671

In [31]:
print('Subset G1:')
print(df.loc['G1'])

print('\nprimeira linha de G2:')
df.loc['G2'].loc[1]

Subset G1:
          a         b
1  1.147188  0.231934
2 -1.521882 -0.025399
3 -0.135156  0.548987

primeira linha de G2:

a   -1.580583
b   -0.389317
Name: 1, dtype: float64

Os index nÃ£o tÃªm nome, o qu3e dificulta buscas como 'Todos os num 1'.
EntÃ£o Ã© preciso nomear os index pra usar a funÃ§Ã£o xs()

In [32]:
print(df.index.names)

df.index.names = ['Grupo', 'num']
df.index.names

[None, None]

FrozenList(['Grupo', 'num'])

In [33]:
print(df)

print(df.xs('G1'))

df.xs(1, level='num') # busca todos os index 1 em todos os Grupos

                  a         b
Grupo num
G1    1    1.147188  0.231934
      2   -1.521882 -0.025399
      3   -0.135156  0.548987
G2    1   -1.580583 -0.389317
      2    1.208457  0.643078
      3    1.577016  0.181671
            a         b
num
1    1.147188  0.231934
2   -1.521882 -0.025399
3   -0.135156  0.548987

              a         b
Grupo
G1     1.147188  0.231934
G2    -1.580583 -0.389317

### 1.9 Tratamento de dados ausentes

In [34]:
df = pd.DataFrame({
    'a': [1, 2, np.nan],
    'b': [5, np.nan, np.nan],
    'c': [1, 2, 3]
})
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Remover Nan's do DataFrame:

In [35]:
print('Drop linhas:')
print(df.dropna())

print('\nDrop colunas:')
print(df.dropna(axis=1))

# thresh Ã© a tolerÃ¢ncia mÃ¡xima de Nan's
df.dropna(axis=1, thresh=2) # drop a partir de 2 Nan's

Drop linhas:
     a    b  c
0  1.0  5.0  1

Drop colunas:
   c
0  1
1  2
2  3

     a  c
0  1.0  1
1  2.0  2
2  NaN  3

Como substituir Nan's por algum valor:

In [36]:
df.fillna('Conteudo')

          a         b  c
0       1.0       5.0  1
1       2.0  Conteudo  2
2  Conteudo  Conteudo  3

In [37]:
print('Substituir NAN da coluna A pela mÃ©dia de A')
df['a'].fillna(df['a'].mean())

Substituir NAN da coluna A pela mÃ©dia de A

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

Replicar o Ãºltimo valor da coluna onde tiver NAN

In [38]:
df.ffill() # forward fill
# df.bfill() # back fill neste df nÃ£o se aplica

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

### 1.10 Groupby

In [39]:
data = {
    'classe': 'Junior Junior Pleno Pleno Senior Senior'.split(),
    'nome': 'Jorge Carlos Roberta Patricia Bruno Vera'.split(),
    'vendas': [200, 120, 340, 124, 243, 350]
}

df = pd.DataFrame(data)
df

   classe      nome  vendas
0  Junior     Jorge     200
1  Junior    Carlos     120
2   Pleno   Roberta     340
3   Pleno  Patricia     124
4  Senior     Bruno     243
5  Senior      Vera     350

In [40]:
group = df.groupby('classe')
group

A princÃ­pio nÃ£o Ã© visÃ­vel, mas quando aplicar funÃ§Ãµes como mean(), sum() etc ele vai aplicar para cada grupo

In [41]:
print('Soma de vendas por classe:')
print(group.sum(numeric_only=True)) # se tivessem mais colunas numÃ©ricas iria aparecer

print('\nMÃ©dia de vendas por classe:')
print(group.mean(numeric_only=True))

print('\nMelhores vendedores por classe:')
print(group.max())

Soma de vendas por classe:
        vendas
classe
Junior     320
Pleno      464
Senior     593

MÃ©dia de vendas por classe:
        vendas
classe
Junior   160.0
Pleno    232.0
Senior   296.5

Melhores vendedores por classe:
           nome  vendas
classe
Junior    Jorge     200
Pleno   Roberta     340
Senior     Vera     350

AtribuiÃ§Ã£o por ReferÃªncia Vs. por Valor

In [42]:
# ObservaÃ§Ã£o!
df2 = df # df2 Ã© um PONTEIRO de df. Qualquer alteraÃ§Ã£o afeta a ambos (REFERÃNCIA)

df2 = df.copy() # faz uma cÃ³pia independente de df (VALOR)

In [43]:
df2['vendas'] = [150, 432, 190, 230, 410, 155]
print(df)
df2

   classe      nome  vendas
0  Junior     Jorge     200
1  Junior    Carlos     120
2   Pleno   Roberta     340
3   Pleno  Patricia     124
4  Senior     Bruno     243
5  Senior      Vera     350

   classe      nome  vendas
0  Junior     Jorge     150
1  Junior    Carlos     432
2   Pleno   Roberta     190
3   Pleno  Patricia     230
4  Senior     Bruno     410
5  Senior      Vera     155

In [44]:
df3 = pd.concat([df, df2])

df3.groupby(['classe', 'nome'])
print(df3)

df3.groupby(['classe', 'nome']).sum()

   classe      nome  vendas
0  Junior     Jorge     200
1  Junior    Carlos     120
2   Pleno   Roberta     340
3   Pleno  Patricia     124
4  Senior     Bruno     243
5  Senior      Vera     350
0  Junior     Jorge     150
1  Junior    Carlos     432
2   Pleno   Roberta     190
3   Pleno  Patricia     230
4  Senior     Bruno     410
5  Senior      Vera     155

                 vendas
classe nome
Junior Carlos       552
       Jorge        350
Pleno  Patricia     354
       Roberta      530
Senior Bruno        653
       Vera         505

### 1.11 merge, concat e join

In [45]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
    },
    index=[0, 1, 2, 3])

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
    },
    index=[4, 5, 6, 7])

df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']
    },
    index=[8, 9, 10, 11])

In [46]:
print(df1)
print('')
print(df2)
print('')
print(df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenar

In [47]:
pd.concat([df1, df2, df3]) # rbind()

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [48]:
pd.concat([df1, df2, df3], axis=1) # cbind()

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Merge

In [49]:
esquerda = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame(
    {'key': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']})

In [50]:
pd.merge(esquerda, direita, on='key') # coluna 'key vai servir de base pro merge

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [51]:
esquerda = pd.DataFrame(
    {'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame(
    {'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']})

In [52]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [53]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [54]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [55]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [56]:
pd.merge(esquerda, direita, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

Join

In [57]:
esquerda = pd.DataFrame(
    {'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
    },
    index=['K0', 'K1', 'K2'])

direita = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
    },
    index=['K0', 'K2', 'K3'])

In [58]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

### 1.12 operaÃ§Ãµes com DataFrames

In [59]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
    })
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [60]:
print(df['col2'].unique())

print(df['col2'].nunique())

df['col2'].value_counts()

[444 555 666]
3

444    2
555    1
666    1
Name: col2, dtype: int64

aplicando funÃ§Ãµes:

In [61]:
def comp(x):
    return x**2 + 3

In [62]:
print(df['col1'].apply(comp))

# OU

df['col1'].apply(lambda x: x**2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [63]:
df['comp_col1'] = df['col1'].apply(comp)
df

   col1  col2 col3  comp_col1
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [64]:
data = {
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [65]:
dict_map = {'one': 1, 'two': 2}
df['E'] = df['B'].map(dict_map)
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [66]:
df.pivot_table(index='A', columns='B', values='D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

### 1.13 Series Temporais no Pandas

In [67]:
numDias = 100

datas = pd.date_range(start='2021-01-01', periods=numDias)
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [68]:
df = pd.DataFrame(range(numDias), columns=['number'], index=datas)
df

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
...            ...
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

[100 rows x 1 columns]

In [69]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [70]:
print(df.index[50])

print(df.index[50].day)
print(df.index[50].month)
print(df.index[50].year)
print(df.index[50].hour)

2021-02-20 00:00:00
20
2
2021
0

In [71]:
df[df.index.day == 10]

            number
2021-01-10       9
2021-02-10      40
2021-03-10      68
2021-04-10      99

In [72]:
df[df.index.month == 2]

            number
2021-02-01      31
2021-02-02      32
2021-02-03      33
2021-02-04      34
2021-02-05      35
2021-02-06      36
2021-02-07      37
2021-02-08      38
2021-02-09      39
2021-02-10      40
2021-02-11      41
2021-02-12      42
2021-02-13      43
2021-02-14      44
2021-02-15      45
2021-02-16      46
2021-02-17      47
2021-02-18      48
2021-02-19      49
2021-02-20      50
2021-02-21      51
2021-02-22      52
2021-02-23      53
2021-02-24      54
2021-02-25      55
2021-02-26      56
2021-02-27      57
2021-02-28      58

In [73]:
import datetime as dt

df[df.index > dt.datetime(2021, 3, 1)] # datas maiores que 01/mar/2021

            number
2021-03-02      60
2021-03-03      61
2021-03-04      62
2021-03-05      63
2021-03-06      64
2021-03-07      65
2021-03-08      66
2021-03-09      67
2021-03-10      68
2021-03-11      69
2021-03-12      70
2021-03-13      71
2021-03-14      72
2021-03-15      73
2021-03-16      74
2021-03-17      75
2021-03-18      76
2021-03-19      77
2021-03-20      78
2021-03-21      79
2021-03-22      80
2021-03-23      81
2021-03-24      82
2021-03-25      83
2021-03-26      84
2021-03-27      85
2021-03-28      86
2021-03-29      87
2021-03-30      88
2021-03-31      89
2021-04-01      90
2021-04-02      91
2021-04-03      92
2021-04-04      93
2021-04-05      94
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

### 1.14 Entrada e SaÃ­da de Dados

In [76]:
df1 = pd.read_csv('exemplo.csv')
df1

          0         1         2         3
0 -0.394813 -0.694630  0.253393  0.602590
1 -2.134217  1.141381 -0.130142  0.690936
2 -0.223754  0.365133 -0.104233 -0.182788
3  0.108066  0.331332  0.053708 -0.280468
4  0.085290  0.740834 -0.596941  0.243950

In [77]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      float64
 2   2       5 non-null      float64
 3   3       5 non-null      float64
dtypes: float64(4)
memory usage: 288.0 bytes

In [80]:
df2 = pd.DataFrame(randn(10,4)*100)
df2

            0           1           2           3
0   63.379366  -94.824359  169.070108   68.897587
1  -34.513341  142.327513   -1.512472 -106.210851
2  -42.943104 -230.030226 -168.945872    7.517640
3  -18.147411  -43.762772   87.252039  -96.646177
4  -86.815250  -41.868074   36.220806   31.012060
5  -37.651788   92.127703   27.417775  180.381343
6  -23.538301  -51.354765   37.448165   82.536779
7  -77.801746  -18.414173  118.224942  126.896154
8  172.708929    4.293015 -111.308628  -88.036496
9   84.936909   40.416627   35.885047  103.447513

In [81]:
df2.to_csv('exemplo2.csv', sep=',', decimal='.')